[
  {
    "name": "Arnald Johnson D",
    "role": "TNPSC Aspirant",
    "text": "JD Academy of Excellence (JDAX) நிறுவனத்தில் நான் பயின்று வருகிறேன். இங்கு வழங்கப்படும் பயிற்சி முறைகள் திட்டமிட்டதாகவும் தேர்வு நோக்குடனும் உள்ளன. தொடர்ச்சியான விடைத்தாள் எழுதும் பயிற்சி என் தன்னம்பிக்கையையும் தயாரிப்புத் திறனையும் மேம்படுத்தியுள்ளது. ஆசிரியர்களின் வழிகாட்டுதல் TNPSC தயாரிப்பில் நல்ல முன்னேற்றத்தை அளித்துள்ளது."
  },
  {
    "name": "R. Tholkappian",
    "role": "TNPSC Aspirant",
    "text": "JDAX Academy has helped me become more disciplined through structured schedules and a clear stage-wise preparation strategy. Focused mains preparation improved my consistency and answer writing skills."
  },
  {
    "name": "Arul Valan J",
    "role": "TNPSC Aspirant",
    "text": "The Integrated TNPSC programme at JD Academy of Excellence provides a peaceful environment and strong faculty support through classes, doubt clearing and daily answer writing practices."
  },
  {
    "name": "Godwin Andrews S",
    "role": "TNPSC Aspirant",
    "text": "JDAX IAS Academy provides excellent guidance with knowledgeable faculty, updated study materials and systematic test series that improve conceptual clarity and confidence."
  },
  {
    "name": "Rithishwaran",
    "role": "TNPSC Aspirant",
    "text": "The integrated TNPSC programme at JDAX has transformed my preparation with clear, well-organized classes and measurable progress."
  },
  {
    "name": "Adil Brutta",
    "role": "TNPSC Aspirant",
    "text": "Daily answer-writing practice and supportive faculty at JDAX helped me gain confidence and see steady progress in my TNPSC preparation."
  },
  {
    "name": "J Janet Jenifer",
    "role": "TNPSC Aspirant",
    "text": "The peaceful and motivating atmosphere at JD Academy of Excellence makes studying easier and the modern teaching style suits competitive exams perfectly."
  },
  {
    "name": "Tifini Maria",
    "role": "TNPSC Aspirant",
    "text": "JDAX feels like a family. Hostel life, staff support and peer encouragement helped me stay motivated and confident throughout my TNPSC preparation."
  },
  {
    "name": "Yuvan Maria Rishalin",
    "role": "TNPSC Aspirant",
    "text": "Mentorship helped me stay focused and consistent. With a clear plan and timely doubt support, the preparation process became organised and manageable."
  },
  {
    "name": "D.K. Deepika Mol",
    "role": "TNPSC Aspirant",
    "text": "Well-structured schedules with regular tests keep preparation consistent. Doubt-clearing sessions and discussions improve understanding and answer-writing skills."
  },
  {
    "name": "Lincy Augustina L",
    "role": "TNPSC Aspirant",
    "text": "JDAX infrastructure is impressive with smart classrooms and modern facilities that create an excellent environment for focused preparation."
  },
  {
    "name": "Smiline Rosy J",
    "role": "TNPSC Aspirant",
    "text": "JDAX provides high-quality education with a well-structured curriculum, comprehensive materials and personal mentorship."
  },
  {
    "name": "Maria Ashmitha",
    "role": "TNPSC Aspirant",
    "text": "Daily tests help track progress. Hostel, food, library and study hall facilities are excellent and support focused TNPSC preparation."
  },
  {
    "name": "Blessy",
    "role": "TNPSC Aspirant",
    "text": "Faculties are accessible and clear doubts without delay. Interactive classes help understand topics in depth."
  },
  {
    "name": "Rathna",
    "role": "TNPSC Aspirant",
    "text": "Clear explanations, regular tests and supportive teachers at JDAX helped improve my confidence and marks."
  },
  {
    "name": "Patricia Jose",
    "role": "UPSC Aspirant",
    "text": "One-to-one mentorship and guidance helped me structure my studies effectively, identify weaknesses and prepare better for the UPSC Civil Services examination."
  },
  {
    "name": "Alka Ekka",
    "role": "UPSC Aspirant",
    "text": "JDAX works as a ladder to UPSC. Teachers are experienced, cooperative and supportive. English-medium teaching helped overcome language barriers."
  },
  {
    "name": "Sruthi Gnana Priya D",
    "role": "UPSC Aspirant",
    "text": "Affordable UPSC preparation with supportive teachers and easy explanations helped me improve both English and subject knowledge."
  },
  {
    "name": "Monica V",
    "role": "UPSC Aspirant",
    "text": "JDAX provides quality coaching at an affordable price with interactive classes, good infrastructure, excellent ambience and continuous doubt support."
  },
  {
    "name": "Melfin J S",
    "role": "UPSC Aspirant",
    "text": "Clear, structured classes and personal mentorship at JDAX keep me motivated and confident in my UPSC preparation."
  },
  {
    "name": "Lenin Illavendhan",
    "role": "UPSC Aspirant",
    "text": "Experienced faculty explain complex UPSC subjects in simple words. Regular motivation and guidance make students confident and exam-ready."
  },
  {
    "name": "Jennita J",
    "role": "UPSC Aspirant",
    "text": "Faculty members are knowledgeable, patient and approachable. Their teaching style motivates us to do our best consistently."
  },
  {
    "name": "Iswarya",
    "role": "UPSC Aspirant",
    "text": "The welcoming environment at JDAX helped me grow academically and personally while preparing for UPSC."
  },
  {
    "name": "Azhagu Albert P",
    "role": "UPSC Aspirant",
    "text": "JDAX IAS Academy helped me build strong UPSC fundamentals through excellent mentorship, test series and doubt-clearing support."
  }
]
